IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28003x_sys_status_regs.xml
<module id="SYS_STATUS_REGS" HW_revision="" description="SYS STATUS Registers">
	<register id="SYS_ERR_INT_FLG" width="32" page="1" offset="0x10" internal="0" description="Status of interrupts due to multiple different errors in the system.">
		<bitfield id="GINT" description="Global Interrupt flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="AES_BUS_ERROR" description="AES_BUS_ERROR Interrupt flag." begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EPGA_INT" description="EPGA_INT Interrupt flag." begin="11" end="11" width="1" rwaccess="R"/>
	</register>
	<register id="SYS_ERR_INT_CLR" width="32" page="1" offset="0x12" internal="0" description="SYS_ERR_INT_FLG clear register">
		<bitfield id="GINT" description="Global Interrupt flag Clear bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="AES_BUS_ERROR" description="AES_BUS_ERROR interrupt flag clear bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPGA_INT" description="EPGA_INT interrupt flag clear bit" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="SYS_ERR_INT_SET" width="32" page="1" offset="0x14" internal="0" description="SYS_ERR_INT_FLG set register">
		<bitfield id="AES_BUS_ERROR" description="AES_BUS_ERROR interrupt flag set bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPGA_INT" description="EPGA_INT interrupt flag set bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="SYS_ERR_MASK" width="32" page="1" offset="0x16" internal="0" description="SYS_ERR_MASK register">
		<bitfield id="AES_BUS_ERROR" description="AES_BUS_ERROR flag mask bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPGA_INT" description="EPGA_INT flag mask bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
</module>
